user/tutorials/Nike/shockDroplet_codestream/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;
divScheme       Doubleflux;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss linear;//none;
    div(tauMC)      Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    //reconstruct(rho) vanLeer;
    reconstruct(thermo:rho) upwind;//vanLeer;
    reconstruct(U)  upwind;//vanLeerV;
    reconstruct(T)  upwind;//vanLeer;
    reconstruct(gammaStar)  upwind;
    reconstruct(eStar)  upwind;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
